InformationRegisters/ОбновленияОбъектовИзВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОбновленияОбъектовИзВнешнихСистем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отвественный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/УниверсальныеМеханизмы/Ext/Module.bsl
// Эта процедура, при удачном раскладе, перейдет в модуль РаботаСДокументами
// и заменит процедуры ЗаполнитьРеквизитыПоУмолчанию и ЗаполнитьЗначенияСвойствНовогоДокумента
Процедура ЗаполнитьОбщиеРеквизитыДокумента(Объект, ДанныеЗаполнения = Неопределено) Экспорт
	
	// Организация в документах есть всегда; у неё всегда установлено свойство "Заполнять из данных заполнения"
	ТребуетсяЗаполнениеОрганизации = Не ЗначениеЗаполнено(Объект.Организация)
		И Не РеквизитЗаполненВДанныхЗаполнения(ДанныеЗаполнения, "Организация");
		
	Если ТипЗнч(Объект) <> Тип("ЗадачаОбъект.ЗадачаИсполнителя") Тогда
		// Ответственный в документах есть всегда
		Объект.Ответственный = РаботаСПользователями.ТекущийПользователь();
	КонецЕсли;
		
	Если ТребуетсяЗаполнениеОрганизации Тогда
		Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	КонецЕсли;
	
	// комментарий в документах есть всегда
	Объект.Комментарий = "";
	
КонецПроцедуры // ЗаполнитьОбщиеРеквизитыДокумента

Процедура ЗаполнитьОбщиеРеквизитыСправочника(Объект, ДанныеЗаполнения = Неопределено) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ПолеСуществует(Объект, "Организация") Тогда
		ТребуетсяЗаполнениеОрганизации = Не ЗначениеЗаполнено(Объект.Организация)
			И Не РеквизитЗаполненВДанныхЗаполнения(ДанныеЗаполнения, "Организация");
		
		Если ТребуетсяЗаполнениеОрганизации Тогда
			Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
		КонецЕсли;	
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ПолеСуществует(Объект, "Наименование") 
		И Объект.Метаданные().ДлинаНаименования > 0 Тогда
		Объект.Наименование = "";
	КонецЕсли;	

	Если ОбщегоНазначенияКлиентСервер.ПолеСуществует(Объект, "Комментарий") Тогда
		Объект.Комментарий = "";
	КонецЕсли;	
	
	Если ОбщегоНазначенияКлиентСервер.ПолеСуществует(Объект, "Ответственный") Тогда
		Объект.Ответственный = РаботаСПользователями.ТекущийПользователь();
	КонецЕсли;	
		
КонецПроцедуры // ЗаполнитьОбщиеРеквизитыСправочника

Процедура ПослеОбработкиПроверкиЗаполнения(Объект, Отказ) Экспорт
	
	Объект.ДополнительныеСвойства.Вставить("ОбработкаПроверкиЗаполненияОтказ", Отказ);
	
КонецПроцедуры // ПослеОбработкиПроверкиЗаполнения

Функция ОбъектМожноЗаписать(Объект, Отказ, РежимЗаписи = Неопределено, РежимПроведения = Неопределено) Экспорт
	Перем ОбработкаПроверкиЗаполненияОтказ, Описание;
	
	// т.к. перед программной записью вызвать проверку заполнения могли и забыть,
	// вызовем её сами
	ПроверкаЗаполненияВыдалаОшибку = Ложь;
	Если Не Объект.ДополнительныеСвойства.Свойство("ОбработкаПроверкиЗаполненияОтказ", ОбработкаПроверкиЗаполненияОтказ) Тогда
		ПроверкаЗаполненияВыдалаОшибку = Не Объект.ПроверитьЗаполнение();
	КонецЕсли;
	//в старых периодах есть документы, с кривым заполнением
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения И ПроверкаЗаполненияВыдалаОшибку Тогда
		ПроверкаЗаполненияВыдалаОшибку = Ложь;	
	КонецЕсли;
	
	Отказ = Отказ Или ПроверкаЗаполненияВыдалаОшибку Или (ОбработкаПроверкиЗаполненияОтказ = Истина);
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
		
	// защита от программного ввода объектов, загружаемых из внешних систем
	Если Не Объект.ДополнительныеСвойства.Свойство("ИмпортИзВнешнейСистемы") // возможность изменять данные элементы программно
			И РаботаСВнешнимиСистемами.ОбъектИмпортируетсяИзВнешнейСистемы(Объект, Описание)
			И Не ЭтоУдалениеСведенийПоВедущемуИзмерению(Объект)
			И Не ЭтоИзменениеПометкиНаУдаление(Объект)
			И (НЕ Объект.ДополнительныеСвойства.Свойство("ОчисткаРегистра")
				ИЛИ НЕ Объект.ДополнительныеСвойства.ОчисткаРегистра)
	Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Описание, Объект,,, Отказ);
		Возврат Ложь;
	КонецЕсли;
	
	// проверки, общие для групп объект метаданных
	ОбъектМД    = Объект.Метаданные();
	ПолноеИмяМД = ОбъектМД.ПолноеИмя();
	
	Если СтрНачинаетсяС(ПолноеИмяМД, "Документ.") Тогда
		
		ЕстьРеквизитСчетДУ = ОбщегоНазначенияКлиентСервер.ПолеСуществует(Объект, "СчетДоверительногоУправления");
		
		// и новые и старые реквизиты не должны попадать в дату запрета редактирования
		Если Не Объект.ЭтоНовый() Тогда
			Если РаботаСДокументами.ЗапретРедактированияДокумента(Объект.Ссылка, Объект, Отказ,,, РежимЗаписи) Тогда
				Возврат Ложь;
			КонецЕсли;
			
			Если Объект.Проведен И РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда
				ИзменилисьРеквизиты = Ложь;
				Если ЕстьРеквизитСчетДУ Тогда
					РеквизитыДатаСчет = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Ссылка, "Дата,СчетДоверительногоУправления");
					ИзменилисьРеквизиты = (НачалоДня(Объект.Дата) <> НачалоДня(РеквизитыДатаСчет.Дата) ИЛИ Объект.СчетДоверительногоУправления <> РеквизитыДатаСчет.СчетДоверительногоУправления);
				Иначе
					ИзменилисьРеквизиты = (НачалоДня(Объект.Дата) <> НачалоДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "Дата")));
				КонецЕсли;
				Если ИзменилисьРеквизиты Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменять дату или счет доверительного управления можно только у непроведенного документа!",,,, Отказ);
					Возврат Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если РаботаСДокументами.ЗапретРедактированияДокумента(Объект, Объект, Отказ,,, РежимЗаписи) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		// акцептованные документы изменять нельзя
		Если Не РаботаСДокументами.АкцептованныйДокументМожноЗаписать(Объект, Отказ) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Если ЕстьРеквизитСчетДУ Тогда
				Если ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
					Если Объект.Организация <> Объект.СчетДоверительногоУправления.Организация Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбранная организация '" + Объект.Организация + "' не соответствует организации '" + Объект.СчетДоверительногоУправления.Организация + "' в выбранном счете доверительного управления '" + Объект.СчетДоверительногоУправления + "'", Объект, "СчетДоверительногоУправления",, Отказ);
						Возврат Ложь;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если Не РаботаСДокументами.ПроверитьРынокЦенныхБумаг(Объект, Отказ) Тогда
				Возврат Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(ПолноеИмяМД, "Регистр") Тогда
		
		Если ПроверитьСоответствиеОрганизацииИПолейРегистра(Объект, Отказ) = Ложь Тогда
			Возврат Ложь;
		КонецЕсли;
		
		РегистрыСКонтролемКоличестваРегистраторов = Новый Массив;
		РегистрыСКонтролемКоличестваРегистраторов.Добавить("РегистрСведений.СтоимостьПереоценки");
		РегистрыСКонтролемКоличестваРегистраторов.Добавить("РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам");
		РегистрыСКонтролемКоличестваРегистраторов.Добавить("РегистрСведений.ФинансовыеПоказатели");
		РегистрыСКонтролемКоличестваРегистраторов.Добавить("РегистрНакопления.РезервыПИФ");
		
		Если РегистрыСКонтролемКоличестваРегистраторов.Найти(ПолноеИмяМД) <> Неопределено 
			И Не ПроверитьКоличествоРегистраторов(ОбъектМД, Объект, Отказ) Тогда
			Возврат Ложь;
		КонецЕсли; 
	
	КонецЕсли;

	Возврат Не Отказ;
	
КонецФункции // ОбъектМожноЗаписать	

Процедура ОбработкаЗаполнения(Объект, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ИсключаемыПоля = "";
	
	Для каждого ЭлементДанныхЗаполнения Из ДанныеЗаполнения Цикл
		
		ДанныеТабЧасти = Неопределено;
		
		Если      ТипЗнч(ЭлементДанныхЗаполнения.Значение) = Тип("Массив") Тогда // массив структур
			ДанныеТабЧасти = ЭлементДанныхЗаполнения.Значение;
			
		ИначеЕсли ТипЗнч(ЭлементДанныхЗаполнения.Значение) = Тип("ХранилищеЗначения") Тогда // таблица значений в хранилище
			ДанныеТабЧасти = ЭлементДанныхЗаполнения.Значение.Получить();
			
			Если ТипЗнч(ДанныеТабЧасти) <> Тип("ТаблицаЗначений") Тогда
				ДанныеТабЧасти = Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеТабЧасти) Тогда
			Для каждого СтрокаТабЧасти Из ДанныеТабЧасти Цикл
				ЗаполнитьЗначенияСвойств(Объект[ЭлементДанныхЗаполнения.Ключ].Добавить(), СтрокаТабЧасти);
			КонецЦикла;
			
			ИсключаемыПоля = ИсключаемыПоля + ?(ПустаяСтрока(ИсключаемыПоля), "", ", ") + ЭлементДанныхЗаполнения.Ключ;
		КонецЕсли;
			
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(Объект, ДанныеЗаполнения,, ИсключаемыПоля);
	
КонецПроцедуры // ОбработкаЗаполнения

////////////////////////////////////////////////////////////////////////////////

Функция ПриСозданииФормыНаСервере(Форма, ИмяОсновногоРеквизита = "Объект", ИмяПоляКлюча = "Ссылка", Отказ = Неопределено) Экспорт
	
	ОсновнойРеквизит = Форма[ИмяОсновногоРеквизита][ИмяПоляКлюча];
	
	МетаданныеОсновногоРеквизита = Метаданные.НайтиПоТипу(ТипЗнч(ОсновнойРеквизит));
	ЭтоРегистрСведений           = Метаданные.РегистрыСведений.Содержит(МетаданныеОсновногоРеквизита);
	
	// если объект импортируется из внешней системы, то форма открывается только на просмотр
	// создание новых элементов при этом запрещено и форма не открывается
	Если Форма.Элементы.Найти("СсылкаОбновить") <> Неопределено Тогда
		Если РаботаСВнешнимиСистемами.ОбъектИмпортируетсяИзВнешнейСистемы(ОсновнойРеквизит) Тогда
			Если ЭтоРегистрСведений И Не ОсновнойРеквизит.Пустой() Или Не ЭтоРегистрСведений И ЗначениеЗаполнено(ОсновнойРеквизит) Тогда
				Форма.ТолькоПросмотр = Истина;
				Форма.Элементы.СсылкаОбновить.Видимость = Истина;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Текущие данные загружаются из внешней системы",,,, Отказ);
				Возврат Ложь;
			КонецЕсли;
		Иначе
			Форма.Элементы.СсылкаОбновить.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
		
	// Форма документа
	Если ОсновнойРеквизит <> Неопределено 
		И Метаданные.Документы.Содержит(МетаданныеОсновногоРеквизита)
		И Не Форма[ИмяОсновногоРеквизита].Свойство("ИсходныйКлючЗаписи") // исключаем форму записи регистра сведений
	Тогда 
	
		// для не новых документов нужно запретить редактирование, если установлена дата запрета редактирования
		Если ЗначениеЗаполнено(ОсновнойРеквизит) Тогда
			ТекстОшибки = "";
			Если РаботаСДокументами.ЗапретРедактированияДокумента(ОсновнойРеквизит, Неопределено, Неопределено, Ложь, ТекстОшибки) Тогда
				Форма.ТолькоПросмотр = Истина;
				РаботаСДокументамиКлиентСервер.УстановитьСостояниеДокумента(Форма, ТекстОшибки, "ДатаЗапретаРедактирования"); 		
			КонецЕсли;
		КонецЕсли;	
	
		// Подтверждение операций
		РаботаСДокументами.ЗаполнитьПодтверждениеОперации(Форма, ОсновнойРеквизит);
		
		// Для операций бэк-офиса заполняем вид внутренннего счета: ДУ или СОБ
		ИмяДокумента = РаботаСДокументами.ПолучитьИмя(ОсновнойРеквизит);
		Если Метаданные.Перечисления.ВидыОперацийБэкОфиса.ЗначенияПеречисления.Найти(ИмяДокумента) <> Неопределено Тогда
			РаботаСДокументамиКлиентСервер.ЗаполнитьВидСчетаВнутреннегоУчета(Форма, ИмяОсновногоРеквизита, ИмяПоляКлюча);
		КонецЕсли;
		
	КонецЕсли;
	
	РаботаСФайловымХранилищем.ДобавитьКомандуПрисоединенныеФайлы(Форма, ОсновнойРеквизит);
	
	// зарегистрируем служебный реквизит, который служит для отключения предшествующего
	// вызова "ПриЧтенииСозданииНаСервере"
	ДобавляемыеРеквизиты = Новый Массив();
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ФормаСоздана", Новый ОписаниеТипов("Булево"),, "Форма создана"));
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Форма.ФормаСоздана = Истина;
	
	// настройка интерфейса под нужды Такси
	Если Форма.Элементы.Найти("Ответственный") <> Неопределено Тогда
		Форма.Элементы.Ответственный.РастягиватьПоГоризонтали = Ложь;
	КонецЕсли;
	
	Если Форма.Элементы.Найти("Комментарий") <> Неопределено Тогда
		Форма.Элементы.Комментарий.АвтоМаксимальнаяШирина = Ложь;
	КонецЕсли;
	
	// обработка заполнения формы
	ПараметрыФормы = Форма.Параметры;
		
	Если ПараметрыФормы.ТолькоПросмотр <> Истина Тогда // бывает, что и Неопределено
		Если ПараметрыФормы.Свойство("ЗначенияЗаполненияФормы") Тогда
			ОбработкаЗаполнения(Форма.Объект, ПараметрыФормы.ЗначенияЗаполненияФормы, );
			Форма.Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ПриСозданииФормыНаСервере

Процедура УстановитьЗаголовокФормы(Форма, ИмяОсновногоРеквизита = "Объект", ИмяПоляКлючаОбъекта = "Ссылка") Экспорт
	
	Форма.АвтоЗаголовок = Ложь;
	
	ОсновнойРеквизит = Форма[ИмяОсновногоРеквизита];
	КлючОбъекта      = ОсновнойРеквизит[ИмяПоляКлючаОбъекта];
	МетаданныеОбъекта = КлючОбъекта.Метаданные();
	ПредставлениеОбъекта = "";
	
	Если Метаданные.Справочники.Содержит(МетаданныеОбъекта) Или Метаданные.Задачи.Содержит(МетаданныеОбъекта) Тогда
		ПредставлениеОбъекта = ?(ЗначениеЗаполнено(МетаданныеОбъекта.РасширенноеПредставлениеОбъекта), МетаданныеОбъекта.РасширенноеПредставлениеОбъекта, 
			?(ЗначениеЗаполнено(МетаданныеОбъекта.ПредставлениеОбъекта), МетаданныеОбъекта.ПредставлениеОбъекта, МетаданныеОбъекта.Представление())) + ": ";
	КонецЕсли; 
	
	Если      ОсновнойРеквизит.Свойство("Проведен") И ОсновнойРеквизит.Проведен Тогда
		Форма.Заголовок = ПредставлениеОбъекта + Строка(КлючОбъекта) + " (проведен)";
	ИначеЕсли ОсновнойРеквизит.Свойство("Выполнена") И ЗначениеЗаполнено(КлючОбъекта) Тогда
		Если ОсновнойРеквизит.Выполнена Тогда
			Форма.Заголовок = ПредставлениеОбъекта + Строка(КлючОбъекта) + " (отработана)";
		Иначе
			Форма.Заголовок = ПредставлениеОбъекта + Строка(КлючОбъекта) + " (зарегистрирована)";
		КонецЕсли; 
	ИначеЕсли ОсновнойРеквизит.ПометкаУдаления Тогда
		Форма.Заголовок = ПредставлениеОбъекта + Строка(КлючОбъекта) + " (помеч. на удаление)";
	ИначеЕсли ЗначениеЗаполнено(КлючОбъекта) Тогда
		Форма.Заголовок = ПредставлениеОбъекта + Строка(КлючОбъекта) + " (записан)";
	Иначе
		ПредставлениеОбъекта = ?(ПредставлениеОбъекта = "", КлючОбъекта.Метаданные().Представление(), СтрЗаменить(ПредставлениеОбъекта, ": ", ""));
		Форма.Заголовок = ПредставлениеОбъекта + " (создание)";
	КонецЕсли;		
	
КонецПроцедуры // УстановитьЗаголовокФормы

Процедура УстановитьЗаголовокСсылкиОбновить(Форма, ОсновнойРеквизит, ВнешняяСистема = Неопределено) Экспорт 
	
	Если ВнешняяСистема = Неопределено Тогда
		РаботаСВнешнимиСистемами.ОбъектИмпортируетсяИзВнешнейСистемы(ОсновнойРеквизит,, ВнешняяСистема)
	КонецЕсли;
	
	ДатаОбновления = РегистрыСведений.ОбновленияОбъектовИзВнешнихСистем.ПолучитьДатуОбновления(ОсновнойРеквизит, ВнешняяСистема);
	
	Если ВнешняяСистема = Справочники.ВнешниеСистемы.ЗУП Тогда
		Форма.Элементы.СсылкаОбновить.Заголовок = "Элементы данного справочника загружаются из " + ВнешняяСистема + ". Последнее обновление: " + ДатаОбновления + ".";
	Иначе
		Форма.Элементы.СсылкаОбновить.Заголовок = "Элементы данного справочника загружаются из " + ВнешняяСистема + ". Последнее обновление: " + ДатаОбновления + ". Обновить?";
	КонецЕсли;
	
	Форма.Элементы.СсылкаОбновить.АвтоМаксимальнаяШирина = Ложь;		
	
КонецПроцедуры // УстановитьЗаголовокСсылкиОбновить

Функция ФормаСоздана(Форма) Экспорт
	
	Возврат ОбщегоНазначенияКлиентСервер.ПолеСуществует(Форма, "ФормаСоздана"); // т.к. нет доступа к коллекции реквизитов формы

КонецФункции // ФормаСоздана

////////////////////////////////////////////////////////////////////////////////

Функция РеквизитЗаполненВДанныхЗаполнения(ДанныеЗаполнения, ИмяРеквизита)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ДанныеЗаполнения.Свойство(ИмяРеквизита) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ЗначениеЗаполнено(ДанныеЗаполнения[ИмяРеквизита]);
	
КонецФункции // РеквизитЗаполненВДанныхЗаполнения

Функция ЭтоУдалениеСведенийПоВедущемуИзмерению(Объект)
	
	ОбъектМД           = Объект.Метаданные();
	ПолноеИмяОбъектаМД = ОбъектМД.ПолноеИмя();
	
	Если Найти(ПолноеИмяОбъектаМД, "РегистрСведений") <> 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Объект.Количество() > 0 Тогда // это не удаление
		Возврат Ложь;
	КонецЕсли;
	
	Если Объект.ДополнительныеСвойства.Свойство("ОчисткаРегистра") И Объект.ДополнительныеСвойства.ОчисткаРегистра Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// если одно из ведущих измерений помечено на удаление, то
	// удаление записей ведомых регистров сведений по нему разрешено
	Для каждого Измерение Из Метаданные.РегистрыСведений[ОбъектМД.Имя].Измерения Цикл
		Если Измерение.Ведущее Тогда
			Если Объект.Отбор[Измерение.Имя].Значение.ПолучитьОбъект() = Неопределено Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции // ЭтоУдалениеСведенийПоВедущемуИзмерению

Функция ЭтоИзменениеПометкиНаУдаление(Объект)
	
	Если Найти(Объект.Метаданные().ПолноеИмя(), "Справочник") <> 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Объект.ПометкаУдаления <> Объект.Ссылка.ПометкаУдаления;
	
КонецФункции // ЭтоИзменениеПометкиНаУдаление

Функция ПроверитьКоличествоРегистраторов(ОбъектМД, Объект, Отказ)
	
	МенеджерРегистра = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ОбъектМД.ПолноеИмя());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаборЗаписей", Объект.Выгрузить());
	Запрос.УстановитьПараметр("Регистратор", Объект.Отбор.Регистратор.Значение);
	Запрос.Текст = МенеджерРегистра.ПолучитьТекстЗапросаДляКонтроляКоличестваРегистраторов();
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТекстСообщения = "Данные по регистру '" + ОбъектМД.Синоним + "' уже зафиксированы документом " + Выборка.Регистратор + 
			Символы.ПС + "Наличие двух регистраторов не допускается";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЦикла;	 
	
	Возврат Результат.Пустой();
	
КонецФункции

Функция ПроверитьСоответствиеОрганизацииИПолейРегистра(Записи, Отказ) Экспорт
	
	ПроверкаТребуется = Ложь;
	
	Если Записи.Количество() > 0 Тогда
		МетаданныеРегистра = Записи.Метаданные();
		Если МетаданныеРегистра.Измерения.Найти("Организация") <> Неопределено Тогда
			ПроверяемыеПоля = РаботаСМетаданнымиПовтИсп.ПолучитьПоляРегистраЗависимыеОтРеквизита(МетаданныеРегистра.ПолноеИмя(), "Организация"); 
			ПроверкаТребуется = (ПроверяемыеПоля.Количество() > 0);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПроверкаТребуется Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос( 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
		|	ЗаписиРегистра.Организация КАК Организация,
		|	&ПроверяемыеПоля КАК ПроверяемыеПоля
		|ПОМЕСТИТЬ _ЗаписиРегистраИсходные
		|ИЗ
		|	&ЗаписиРегистра КАК ЗаписиРегистра
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗаписиРегистраИсходные.НомерЗаписи КАК НомерЗаписи,
		|	_ЗаписиРегистраИсходные.Организация КАК Организация,
		|	&ПроверяемыеПоля КАК ПроверяемыеПоля,
		|	&ТипыПроверяемыхПолей КАК ТипыПроверяемыхПолей
		|ПОМЕСТИТЬ _ЗаписиРегистраТипыПолей
		|ИЗ
		|	_ЗаписиРегистраИсходные КАК _ЗаписиРегистраИсходные");
	
	ТекстЗапросаПолей = Новый Массив;
	ТекстЗапросаТиповПолей = Новый Массив;
	
	Для Каждого Поле Из ПроверяемыеПоля Цикл
		
		ТекстЗапросаПолей.Добавить(Поле + " КАК " + Поле);
		ТекстЗапросаТиповПолей.Добавить("ТИПЗНАЧЕНИЯ(" + Поле + ") КАК Тип" + Поле);
		
	КонецЦикла;
	
	ПереводСтроки = Символы.ПС + Символы.Таб;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПроверяемыеПоля КАК ПроверяемыеПоля", СтрСоединить(ТекстЗапросаПолей, "," + ПереводСтроки));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТипыПроверяемыхПолей КАК ТипыПроверяемыхПолей", СтрСоединить(ТекстЗапросаТиповПолей, "," + ПереводСтроки));
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ЗаписиРегистра", Записи);
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос.Выполнить();
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗаписиРегистраТипыПолей.НомерЗаписи КАК НомерЗаписи,
		|	_ЗаписиРегистраТипыПолей.Организация КАК Организация,
		|	&ПроверяемыеПоля КАК ПроверяемыеПоля,
		|	&ЗначенияОрганизации КАК ЗначенияОрганизации
		|ПОМЕСТИТЬ _ЗаписиРегистра
		|ИЗ
		|	_ЗаписиРегистраТипыПолей КАК _ЗаписиРегистраТипыПолей";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПроверяемыеПоля КАК ПроверяемыеПоля", СтрСоединить(ТекстЗапросаПолей, "," + ПереводСтроки));
	
	ТекстЗапросаОрганизация = Новый Массив;
	
	Для Каждого Поле Из ПроверяемыеПоля Цикл
		
		ВыборкаТипыЗначений = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(
			Запрос.МенеджерВременныхТаблиц, "_ЗаписиРегистраТипыПолей", Истина, "Тип" + Поле, , "Тип" + Поле).Выбрать();
			
		МассивВариантов = Новый Массив;
		
		Пока ВыборкаТипыЗначений.Следующий() Цикл
		
			МетаданныеПоля = Метаданные.НайтиПоТипу(ВыборкаТипыЗначений["Тип" + Поле]);
			
			Если МетаданныеПоля = Неопределено Или Метаданные.Перечисления.Содержит(МетаданныеПоля) Тогда
				
				Вариант = СтрШаблон(
					"	КОГДА _ЗаписиРегистраТипыПолей.%1 = Неопределено
					|			ТОГДА ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)",
					Поле);
					
			ИначеЕсли РаботаСМетаданнымиПовтИсп.ЕстьРеквизитОбъекта(МетаданныеПоля.ПолноеИмя(), "Организация") Тогда
				
				Вариант = СтрШаблон(
					"	КОГДА ТИПЗНАЧЕНИЯ(_ЗаписиРегистраТипыПолей.%1) = ТИП(%2)
					|			ТОГДА ВЫРАЗИТЬ(_ЗаписиРегистраТипыПолей.%1 КАК %2).Организация",
					Поле,
					МетаданныеПоля.ПолноеИмя());
					
			Иначе
				
				Вариант = СтрШаблон(
					"	КОГДА ТИПЗНАЧЕНИЯ(_ЗаписиРегистраТипыПолей.%1) = ТИП(%2)
					|			ТОГДА ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)",
					Поле,
					МетаданныеПоля.ПолноеИмя());
			
			КонецЕсли;
			
			МассивВариантов.Добавить(Вариант);
			
		КонецЦикла;
		
		ПодстрокаОрганизация = СтрШаблон(
			"ВЫБОР
			|		%1
			|	КОНЕЦ КАК %2", 
			СтрСоединить(МассивВариантов, Символы.ПС),
			Поле + "Организация");
			
		ТекстЗапросаОрганизация.Добавить(ПодстрокаОрганизация);
				
	КонецЦикла; 
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЗначенияОрганизации КАК ЗначенияОрганизации", СтрСоединить(ТекстЗапросаОрганизация, "," + Символы.ПС));
	Запрос.Выполнить();
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	_ЗаписиРегистра.НомерЗаписи КАК НомерЗаписи,
		|	_ЗаписиРегистра.Организация КАК Организация,
		|	&Поле КАК Поле,
		|	&ЗначениеПоля КАК ЗначениеПоля,
		|	&ОрганизацияПоля КАК ОрганизацияПоля
		|ИЗ
		|	_ЗаписиРегистра КАК _ЗаписиРегистра
		|ГДЕ
		|	&Условия";
	
	ТекстЗапросаУсловий			= Новый Массив;
	ТекстЗапросаПоля			= Новый Массив;
	ТекстЗапросаЗначенияПоля	= Новый Массив;
	ТекстЗапросаОрганизацииПоля	= Новый Массив;	
		
	Для Каждого Поле Из ПроверяемыеПоля Цикл
		
		УсловиеОшибки = СтрШаблон("%1 ЕСТЬ НЕ NULL И %1 <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) И %1 <> _ЗаписиРегистра.Организация", 
			"_ЗаписиРегистра." + Поле + "Организация");
		
		ТекстЗапросаУсловий.Добавить(УсловиеОшибки);
		ТекстЗапросаПоля.Добавить("		КОГДА " + УсловиеОшибки + " ТОГДА """ + Поле + """");
		ТекстЗапросаЗначенияПоля.Добавить("		КОГДА " + УсловиеОшибки + " ТОГДА _ЗаписиРегистра." + Поле);
		ТекстЗапросаОрганизацииПоля.Добавить("		КОГДА " + УсловиеОшибки + " ТОГДА _ЗаписиРегистра." + Поле + "Организация");
		
	КонецЦикла;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условия", СтрСоединить(ТекстЗапросаУсловий, Символы.ПС + "	ИЛИ "));
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Поле",			"ВЫБОР" + Символы.ПС + СтрСоединить(ТекстЗапросаПоля, Символы.ПС) + Символы.ПС + "КОНЕЦ");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЗначениеПоля",	"ВЫБОР" + Символы.ПС + СтрСоединить(ТекстЗапросаЗначенияПоля, Символы.ПС) + Символы.ПС + "КОНЕЦ");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОрганизацияПоля","ВЫБОР" + Символы.ПС + СтрСоединить(ТекстЗапросаОрганизацииПоля, Символы.ПС) + Символы.ПС + "КОНЕЦ");
	
	ОшибочныеЗаписи = Запрос.Выполнить().Выбрать();
	Если ОшибочныеЗаписи.Следующий() Тогда
		ТекстОшибки = СтрШаблон("В строке %1 организация '%2' не соответствует организации '%3' в '%4' (поле '%5')",
			Формат(ОшибочныеЗаписи.НомерЗаписи, "ЧГ="), ОшибочныеЗаписи.Организация, ОшибочныеЗаписи.ОрганизацияПоля, ОшибочныеЗаписи.ЗначениеПоля, ОшибочныеЗаписи.Поле);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПроверитьСоответствиеОрганизацииИСчетаДоверительногоУправленияВРегистре(ПолноеИмяМД, Записи, Отказ, ПолеСчетаДУ = "СчетДоверительногоУправления") Экспорт
	
	Если Найти(ПолноеИмяМД, "РегистрСведений.") = 1 Тогда
		ИзмеренияМД = Записи.Метаданные().Измерения;
		ПроверкаТребуется = (ИзмеренияМД.Найти("Организация") <> Неопределено И ИзмеренияМД.Найти(ПолеСчетаДУ) <> Неопределено);
	Иначе // во всех прочих регистрах эти измерения должны быть
		ПроверкаТребуется = Истина;
	КонецЕсли;
	
	Если Не ПроверкаТребуется Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КэшОрганизаций = Новый Соответствие;
	
	НомЗаписи = 1;
	Для каждого Запись Из Записи Цикл
		Если ТипЗнч(Запись[ПолеСчетаДУ]) = Тип("СправочникСсылка.СчетаДоверительногоУправления") И ЗначениеЗаполнено(Запись[ПолеСчетаДУ]) Тогда
			текОрганизация = КэшОрганизаций.Получить(Запись[ПолеСчетаДУ]);
			Если текОрганизация = Неопределено Тогда
				текОрганизация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись[ПолеСчетаДУ], "Организация");
				КэшОрганизаций.Вставить(Запись[ПолеСчетаДУ], текОрганизация);
			КонецЕсли;
			Если Запись.Организация <> текОрганизация Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбранная организация '" + Запись.Организация + "' не соответствует организации '" + текОрганизация + "' в выбранном счете доверительного управления '" + Запись[ПолеСчетаДУ] + "' в записи № " + НомЗаписи,,,, Отказ);
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		НомЗаписи = НомЗаписи + 1;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // ПроверитьСоответствиеОрганизацииИСчетаДоверительногоУправленияВРегистре

// Возвращает таблицу - результат сравнения двух таблиц Таблица0 и Таблица1 той же структуры, что и сравниваемые таблицы
// Таблица содержит отличающиеся строки двух таблиц (удаленные, добавленные, измененные). 
// При этом в дополнительном столбце «Знак» стоит отметка: 0 – если строка имеется в Таблице0 и 1 – если строка имеется в Таблице1. 
// Параметр Измерения позволяет задать перечень полей для сортировки результирующей таблицы, разделенных запятыми
Функция РазницаТаблицЗначений(Таблица0, Таблица1, Измерения = "") Экспорт
    
    Запрос = Новый Запрос;
	
	Запрос.Текст = 
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |    0 КАК Знак,
	    |    Т.Поле
	    |ПОМЕСТИТЬ Т0
	    |ИЗ
	    |    &Таблица0 КАК Т
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |    1 КАК Знак,
	    |    Т.Поле
	    |ПОМЕСТИТЬ Т1
	    |ИЗ
	    |    &Таблица1 КАК Т
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |    Т.Знак,
	    |    Т.Поле
	    |ПОМЕСТИТЬ Т
	    |ИЗ
	    |    Т0 КАК Т
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |    Т.Знак,
	    |    Т.Поле
	    |ИЗ
	    |    Т1 КАК Т
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |    СУММА(Т.Знак) КАК Знак,
	    |    Т.Поле
	    |ИЗ
	    |    Т КАК Т
	    |
	    |СГРУППИРОВАТЬ ПО
	    |    Т.Поле
	    |
	    |ИМЕЮЩИЕ
	    |    КОЛИЧЕСТВО(*) = 1";
    
    ВсеКолонки = "";
    
    Для Каждого Колонка Из Таблица1.Колонки Цикл 
        ВсеКолонки = ВсеКолонки + ", Т." + Колонка.Имя
    КонецЦикла;
    
    Запрос.Текст = СтрЗаменить(Запрос.Текст, "Т.Поле", Сред(ВсеКолонки, 2)); 
    
	Если ЗначениеЗаполнено(Измерения) Тогда
	
		Запрос.Текст = Запрос.Текст + "
	    |
	    |УПОРЯДОЧИТЬ ПО
	    |    Поле//";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Поле//", Измерения);
	
	КонецЕсли; 
	
    Запрос.УстановитьПараметр("Таблица0", Таблица0);
    Запрос.УстановитьПараметр("Таблица1", Таблица1);
    
    Возврат Запрос.Выполнить().Выгрузить()
    
КонецФункции

// Выполняет сравнение версий объекта до записи и после. Для выполнения сравнения необходимо:
// 1. Разработать экспортную функцию модуля объекта ПолучитьВерсиюОбъекта(). Пример функции: Справочник.ИнвестиционныеДекларации
// 2. В обработчике ПередЗаписью объкта поместить в значение ДополнительногоСвойства объекта "ВерсияПередЗаписью" результат выполнения функции ПолучитьВерсиюОбъекта()
// 3. В обработчике ПриЗаписи получить и обработать результат выполенния функции ПолучитьРазличияВерсийОбъекта
Функция ПолучитьРазличияВерсийОбъекта(Объект) Экспорт

	ВерсияПередЗаписью = Неопределено;
	
	Если Объект.ДополнительныеСвойства.Свойство("ВерсияПередЗаписью", ВерсияПередЗаписью) Тогда
		
		ВерсияПриЗаписи = Объект.ПолучитьВерсиюОбъекта();
		
		РезультатСравнения = Новый Структура;
				
		Для каждого ЭлементСтруктуры Из ВерсияПередЗаписью Цикл
			
			СтараяВерсия = ЭлементСтруктуры.Значение;
			НоваяВерсия = ВерсияПриЗаписи[ЭлементСтруктуры.Ключ];
			
			РезультатСравнения.Вставить(ЭлементСтруктуры.Ключ, РазницаТаблицЗначений(СтараяВерсия, НоваяВерсия));			
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат РезультатСравнения;
	
КонецФункции

//Проверяет заполнено измерение/ресурс или нет по доп. условию
//Если параметр Заполнен = Истина, то ресурс должен быть заполнен, если Ложь, то должен быть пустым
Процедура ПроверкаЗаполненияИзмеренияИлиРесурса(Объект, Запись, ИмяПоля, Отказ, Заполнен = Истина) Экспорт
	
	Поле = Объект.Метаданные().Ресурсы.Найти(ИмяПоля);
	
	Если Поле = Неопределено Тогда
		Поле = Объект.Метаданные().Измерения.Найти(ИмяПоля);
	КонецЕсли;
	
	Если Поле = Неопределено Тогда
		ВызватьИсключение "В регистре " + Объект.Метаданные().Имя + " отсутствует поле " + ИмяПоля; 
	КонецЕсли;	
	
	Если Поле.Тип = Новый ОписаниеТипов("Булево") Тогда 
		//булево всегда заполнено, проверка должна быть на значение
		Возврат;
	КонецЕсли;
	
	Если Заполнен И НЕ ЗначениеЗаполнено(Запись[ИмяПоля]) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле """ + Поле.Синоним + """ не заполнено", Объект, ИмяПоля,, Отказ);
		
	ИначеЕсли НЕ Заполнен И ЗначениеЗаполнено(Запись[ИмяПоля]) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле """ + Поле.Синоним + """ должно быть пустым", Объект, ИмяПоля,, Отказ);
	КонецЕсли;		
	
КонецПроцедуры

//Проверяет, что удаление набора записей регистра идёт при непосредственном удалении ведущего измерения
//Параметры:
//	Объект - объект регистра
//
Функция УдалениеНабораЗаписейРегистраВСоставеВедущегоИзмерения(Объект) Экспорт
	
	Для Каждого Измерение Из ОбщегоНазначенияПовтИсп.ПолучитьМассивВедущихИзмерений(Объект.Метаданные().ПолноеИмя()) Цикл
		Если Объект.Отбор.Найти(Измерение) <> Неопределено
		   И ЗначениеЗаполнено(Объект.Отбор.Найти(Измерение).Значение)
		   И СистемныеФункции.СсылочныйТип(Объект.Отбор.Найти(Измерение).Значение)
		   И НЕ СистемныеФункции.СсылкаСуществует(Объект.Отбор.Найти(Измерение).Значение) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

//Заполняет организацию в регистре значением организации в ведущем измерении
Процедура ЗаполнитьОрганизациюИзВедущегоИзмерения(НаборЗаписей, ВедущееИзмерение) Экспорт
	
	Если НЕ НаборЗаписей.Количество() Тогда //нечего ззаполнять
		Возврат;
	КонецЕсли;
	
	Если НаборЗаписей.Отбор.Найти("Регистратор") = Неопределено Тогда //Если отбор по регистратору, отбора по организации не будет
		НаборЗаписей.Отбор.Организация.Использование = Ложь; //Если организация в используемом отборе и в наборе не совпадут, будет отказ.
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаборЗаписей", НаборЗаписей.Выгрузить(, ВедущееИзмерение));
	Запрос.Текст = 
	    СтрШаблон(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НаборЗаписей.%1
			|ПОМЕСТИТЬ _НаборЗаписей
			|ИЗ 
			|	&НаборЗаписей КАК НаборЗаписей
			|;
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_НаборЗаписей.%1 КАК Ключ,
			|	_НаборЗаписей.%1.Организация КАК Значение
			|ИЗ
			|	_НаборЗаписей КАК _НаборЗаписей
			|ГДЕ 
			|	_НаборЗаписей.%1.Организация ЕСТЬ НЕ NULL", ВедущееИзмерение);
	
	ОрганизацииОбъектов = Новый Соответствие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОрганизацииОбъектов.Вставить(Выборка.Ключ, Выборка.Значение);
	КонецЦикла;
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Если ОрганизацииОбъектов.Получить(Запись[ВедущееИзмерение]) <> Неопределено Тогда //Если объект не создан в БД, то заполнять организацию нужно по месту создания записи
			Запись.Организация = ОрганизацииОбъектов.Получить(Запись[ВедущееИзмерение]);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает контрольную сумму (SHA512), вычисленную для переданных двоичных данных
//
Функция ПолучитьКонтрольнуюСуммуДвоичныхДанных(Данные, ТипХешСуммы = Неопределено) Экспорт
	
	Если ТипЗнч(Данные) <> Тип("ДвоичныеДанные") Тогда
		ВызватьИсключение "Получение контрольной суммы доступно только для двоичных данных!";
	КонецЕсли;
	
	Если ТипХешСуммы = Неопределено Тогда
		ТипХешСуммы = ХешФункция.SHA512;
	КонецЕсли;
	
	ХешированиеДанных = Новый ХешированиеДанных(ТипХешСуммы);
	
	ХешированиеДанных.Добавить(Данные);
	
	Возврат Base64Строка(ХешированиеДанных.ХешСумма);
	
КонецФункции

//Заполняет измерение НомерПоПорядку для новых записей
Процедура ЗаполнитьНомерПоПорядкуПередЗаписью(НаборЗаписей) Экспорт
	
	ЗаписиБезНомераПоПорядку = НаборЗаписей.Выгрузить().Скопировать(Новый Структура("НомерПоПорядку", 0));
	
	Если ЗаписиБезНомераПоПорядку.Количество() Тогда
		
		ИмяРегистра = НаборЗаписей.Метаданные().Имя;
		
		Если НаборЗаписей.Отбор.Найти("НомерПоПорядку") <> Неопределено Тогда 
			НаборЗаписей.Отбор.НомерПоПорядку.Использование = Ложь; 
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НаборЗаписей", ЗаписиБезНомераПоПорядку);
		Запрос.Текст = 
		    СтрШаблон(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	НаборЗаписей.Организация КАК Организация,
				|	НаборЗаписей.ЮрФизЛицо КАК ЮрФизЛицо
				|ПОМЕСТИТЬ _НаборЗаписей
				|ИЗ
				|	&НаборЗаписей КАК НаборЗаписей
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	_НаборЗаписей.Организация КАК Организация,
				|	_НаборЗаписей.ЮрФизЛицо КАК ЮрФизЛицо,
				|	МАКСИМУМ(ЕСТЬNULL(РегистрСведений.НомерПоПорядку, 0)) КАК НомерПоПорядку
				|ИЗ
				|	_НаборЗаписей КАК _НаборЗаписей
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.%1 КАК РегистрСведений
				|		ПО _НаборЗаписей.Организация = РегистрСведений.Организация
				|			И _НаборЗаписей.ЮрФизЛицо = РегистрСведений.ЮрФизЛицо
				|
				|СГРУППИРОВАТЬ ПО
				|	_НаборЗаписей.Организация,
				|	_НаборЗаписей.ЮрФизЛицо", ИмяРегистра);
		
		НомераПоПорядку = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Если НЕ ЗначениеЗаполнено(Запись.НомерПоПорядку) Тогда
				ПараметрыПоиска = Новый Структура("Организация,ЮрФизЛицо", Запись.Организация, Запись.ЮрФизЛицо);
				НайденныеСтроки = НомераПоПорядку.НайтиСтроки(ПараметрыПоиска);
				
				НайденныеСтроки[0].НомерПоПорядку = НайденныеСтроки[0].НомерПоПорядку + 1;
				Запись.НомерПоПорядку = НайденныеСтроки[0].НомерПоПорядку;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

//Заполняет измерение НомерПоПорядку для остальных записей, если запись удаляется
Процедура ЗаполнитьНомерПоПорядкуПриЗаписи(НаборЗаписей) Экспорт
	
	Если НаборЗаписей.Количество() = 0 И НЕ НаборЗаписей.ДополнительныеСвойства.УдалениеВСоставеИзмененияНабора Тогда //при удалениии, нужно перенумеровать остальные записи
		
		ИмяРегистра = НаборЗаписей.Метаданные().Имя;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		    СтрШаблон(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	РегистрСведений.*
				|ИЗ
				|	РегистрСведений.%1 КАК РегистрСведений
				|ГДЕ
				|	&УсловиеОрганизация
				|	И &УсловиеЮрФизЛицо
				|
				|УПОРЯДОЧИТЬ ПО
				|	НомерПоПорядку
				|ИТОГИ ПО
				|	Организация,
				|	ЮрФизЛицо", ИмяРегистра);
		
		Если НаборЗаписей.Отбор.Найти("НомерПоПорядку") <> Неопределено Тогда 
			НаборЗаписей.Отбор.НомерПоПорядку.Использование = Ложь; 
		КонецЕсли;
		
		Если НаборЗаписей.Отбор.Найти("Организация") <> Неопределено И НаборЗаписей.Отбор.Организация.Использование Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОрганизация", "РегистрСведений.Организация = &Организация");
			Запрос.УстановитьПараметр("Организация", НаборЗаписей.Отбор.Организация.Значение);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОрганизация", "ИСТИНА");
		КонецЕсли;
		
		Если НаборЗаписей.Отбор.Найти("ЮрФизЛицо") <> Неопределено И НаборЗаписей.Отбор.ЮрФизЛицо.Использование Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЮрФизЛицо", "РегистрСведений.ЮрФизЛицо = &ЮрФизЛицо");
			Запрос.УстановитьПараметр("ЮрФизЛицо", НаборЗаписей.Отбор.ЮрФизЛицо.Значение);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЮрФизЛицо", "ИСТИНА");
		КонецЕсли;
		
		ВыборкаОрганиазция = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОрганиазция.Следующий() Цикл 
			
			ВыборкаЮрФизЛицо = ВыборкаОрганиазция.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЮрФизЛицо.Следующий() Цикл
				
				НовыйНаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
				НовыйНаборЗаписей.Отбор.Организация.Установить(ВыборкаОрганиазция.Организация);
				НовыйНаборЗаписей.Отбор.ЮрФизЛицо.Установить(ВыборкаЮрФизЛицо.ЮрФизЛицо);
				
				ВыборкаДетальныеЗаписи = ВыборкаЮрФизЛицо.Выбрать(ОбходРезультатаЗапроса.Прямой);
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Запись = НовыйНаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(Запись, ВыборкаДетальныеЗаписи);
					Запись.НомерПоПорядку = НовыйНаборЗаписей.Количество();
				КонецЦикла;
				
				НовыйНаборЗаписей.Записать();
			
			КонецЦикла;
			
		КонецЦикла;	
	
	КонецЕсли;
	
КонецПроцедуры
